#+TODO: TODO | DISABLED
** capture-templates
#+begin_src emacs-lisp
  (setq org-roam-capture-templates
        '(("d" "default" plain
           "%?"
           :if-new (file+head "%<%Y%m%d%H%M%S> - ${slug}.org"
                              "#+title: ${title}\n#+date: %T\nTime-stamp: <>")
           :unnarrowed t
           )
          ("p" "project" plain
           "* Goals\n\n%?\n\n* Tasks\n\n** TODO Add initial tasks\n\n* Dates\n\n"
           :if-new (file+head "%<%Y%m%d%H%M%S> - ${slug}.org"
                              "#+title: ${title}\n#+category: ${title}\n#+filetags: Project")
           :unnarrowed t
           )
          ("l" "literature" plain
           "%?"
           :if-new (file+head "%<%Y%m%d%H%M%S> - ${slug}.org"
                              "#+title: ${title}\n")
           :unnarrowed t
           )
          ("t" "todo" plain
           "\n\n** TODO ${title}\n:PROPERTIES:\n:OPENED: %T\n%?"
           :target (file+olp "Todo List.org"
                             ("Todo Items"))
           :unarrowed t
           )
          )
   )
#+end_src

#+RESULTS:
| d | default | plain | %? | :if-new | (file+head %<%Y%m%d%H%M%S> - ${slug}.org #+title: ${title} |


